ams/src/Catalogs/AMS_АдресаДоставки/AMS_АдресаДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AMS_АдресаДоставки</name>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ams/src/Catalogs/AMS_АдресаДоставки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьАдресаДоставки(Партнер) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.АдресДоставки КАК АдресДоставки,
	|	т.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	т.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	т.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	т.ВремяДоставкиС КАК ВремяДоставкиС,
	|	т.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	т.ЗонаДоставки КАК ЗонаДоставки
	|ИЗ
	|	Справочник.AMS_АдресаДоставки КАК т
	|ГДЕ
	|	т.Владелец = &Партнер
	|	И НЕ т.ПометкаУдаления";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

#КонецЕсли
